nxp-mcuxpresso/mcux-devices-wireless/KW/KW43B43ZC7/iar/startup_KW43B43ZC7.s
.ram_init_sram0:                ; Initialize SRAM0
        LDR     R0, =0x20000000
        LDR     R1, =0x20010000
        LDR     R2, =0
        LDR     R3, =0
        LDR     R4, =0
        LDR     R5, =0
.loop01:
        STMIA   R0!, {R2 - R5}
        CMP     R0, R1
        BCC.N   .loop01

.ram_init_done:
#endif
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B .

        PUBWEAK SecureFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SecureFault_Handler
        B .

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B .

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B .

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B .

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B .

        PUBWEAK CTI_IRQHandler
        PUBWEAK CMC0_IRQHandler
        PUBWEAK DMA0_CH0_IRQHandler
        PUBWEAK DMA0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH0_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH1_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH2_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH3_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH4_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH5_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH6_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH7_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH8_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH8_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH9_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH9_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH10_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH11_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH11_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH12_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH12_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH13_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH13_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH14_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH14_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH15_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH15_IRQHandler
        LDR     R0, =DMA0_DriverIRQHandler
        BX      R0

        PUBWEAK EWM0_IRQHandler
        PUBWEAK MCM0_IRQHandler
        PUBWEAK MSCM0_IRQHandler
        PUBWEAK SYSCON0_IRQHandler
        PUBWEAK SECCON0_IRQHandler
        PUBWEAK SPC0_IRQHandler
        PUBWEAK WUU0_IRQHandler
        PUBWEAK WDOG0_IRQHandler
        PUBWEAK WDOG1_IRQHandler
        PUBWEAK CDOG0_IRQHandler
        PUBWEAK CDOG1_IRQHandler
        PUBWEAK SCG0_IRQHandler
        PUBWEAK SFA0_IRQHandler
        PUBWEAK SFA0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SFA0_IRQHandler
        LDR     R0, =SFA0_DriverIRQHandler
        BX      R0

        PUBWEAK FMU0_IRQHandler
        PUBWEAK SFA1_IRQHandler
        PUBWEAK SFA1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SFA1_IRQHandler
        LDR     R0, =SFA1_DriverIRQHandler
        BX      R0

        PUBWEAK DSB0_IRQHandler
        PUBWEAK TRDC0_IRQHandler
        PUBWEAK RTC_Alarm_IRQHandler
        PUBWEAK RTC_Seconds_IRQHandler
        PUBWEAK LPTMR0_IRQHandler
        PUBWEAK LPTMR1_IRQHandler
        PUBWEAK LPIT0_IRQHandler
        PUBWEAK TPM_DriverIRQHandler
        PUBWEAK TPM_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TPM_0_IRQHandler
        LDR     R1, =TPM_DriverIRQHandler
        LDR     R0, =0x0
        BX      R1

        PUBWEAK TPM_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TPM_1_IRQHandler
        LDR     R1, =TPM_DriverIRQHandler
        LDR     R0, =0x1
        BX      R1

        PUBWEAK TPM_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TPM_2_IRQHandler
        LDR     R1, =TPM_DriverIRQHandler
        LDR     R0, =0x2
        BX      R1

        PUBWEAK TPM_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TPM_3_IRQHandler
        LDR     R1, =TPM_DriverIRQHandler
        LDR     R0, =0x3
        BX      R1

        PUBWEAK TPM_4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TPM_4_IRQHandler
        LDR     R1, =TPM_DriverIRQHandler
        LDR     R0, =0x4
        BX      R1

